male('Павел Мерц').
female('Екатерина Мачкова').
male('Савелий Мерц').
female('Людмила Алёхина').
male('Валентин Мачков').
female('Эмилия Разваляева').
male('Валерьян Мерц').
male('Фридрих Мерц').
female('Раиса Мерц').
male('Алексей Мерц').
male('Пётр Разваляев').
female('Анна Разваляева').
female('Елена Мачкова').
female('Татьяна Мачкова').
female('Зинаида Родионова').
female('Татьяна Мачкова').
male('Гавриил Мачков').
child('Савелий Мерц', 'Павел Мерц').
child('Савелий Мерц', 'Екатерина Мачкова').
child('Екатерина Мачкова', 'Валентин Мачков').
child('Екатерина Мачкова', 'Людмила Алёхина').
child('Елена Мачкова', 'Валентин Мачков').
child('Елена Мачкова', 'Людмила Алёхина').
child('Татьяна Мачкова', 'Валентин Мачков').
child('Татьяна Мачкова', 'Людмила Алёхина').
child('Алексей Мерц', 'Валерьян Мерц').
child('Алексей Мерц', 'Эмилия Разваляева').
child('Павел Мерц', 'Валерьян Мерц').
child('Павел Мерц', 'Эмилия Разваляева').
child('Валерьян Мерц', 'Фридрих Мерц').
child('Валерьян Мерц', 'Раиса Мерц').
child('Эмилия Разваляева', 'Пётр Разваляев').
child('Эмилия Разваляева', 'Анна Разваляева').
child('Людмила Алёхина', 'Зинаида Родионова').
child('Людмила Алёхина', 'Анна Разваляева').
child('Валентин Мачков', 'Гавриил Мачков').
child('Валентин Мачков', 'Татьяна Мачкова').
